# 엑셀 파일 불러오기

population1_2540 = read_excel("/Users/seungwoo/Desktop/population_R/dataset/1925,1940population.xlsx")
population2_4470 = read_excel("/Users/seungwoo/Desktop/population_R/dataset/1944~1970population.xlsx")
population3_7510 = read_excel("/Users/seungwoo/Desktop/population_R/dataset/1975~2010population.xlsx")
population4_1521 = read_excel("/Users/seungwoo/Desktop/population_R/dataset/15~21population.xlsx")

#엑셀파일을 모두 dataframe으로 저장합니다.

df_1 = data.frame(population1_2540)
df_2 = data.frame(population2_4470)
df_3 = data.frame(population3_7510)
df_4 = data.frame(population4_1521)

#행정구역별 column에 value를 채워줍니다.

df_1["행정구역별"][3:20,1] <- "경기도"
df_1["행정구역별"][22:39,1] <- "강원도"
df_1["행정구역별"][41:58,1] <- "충청북도"
df_1["행정구역별"][60:77,1] <- "충청남도"
df_1["행정구역별"][79:96,1] <- "전라북도"
df_1["행정구역별"][98:115,1] <- "전라남도"
df_1["행정구역별"][117:134,1] <- "경상북도"
df_1["행정구역별"][136:153 ,1] <- "경상남도"
df_1["행정구역별"][155:172,1] <- "황해도"
df_1["행정구역별"][174:191,1] <- "평안북도"
df_1["행정구역별"][193:210,1] <- "평안남도"
df_1["행정구역별"][212:229,1] <- "함경북도"
df_1["행정구역별"][231:248,1] <- "함경남도"

df_2$행정구역별[3:20] <- "서울특별시"
df_2$행정구역별[22:39] <- "부산광역시"
df_2$행정구역별[40:58] <- "경기도"
df_2$행정구역별[60:77] <- "강원도"
df_2$행정구역별[79:96] <- "충청북도"
df_2$행정구역별[98:115] <- "충청남도"
df_2$행정구역별[117:134] <- "전라북도"
df_2$행정구역별[136:153] <- "전라남도"
df_2$행정구역별[155:172] <- "경상북도"
df_2$행정구역별[174:191] <- "경상남도"
df_2$행정구역별[193:210] <- "제주도"
df_2$행정구역별[212:228] <- "황해도"
df_2$행정구역별[230:246] <- "평안북도"
df_2$행정구역별[248:264] <- "평안남도"
df_2$행정구역별[266:282] <- "함경북도"
df_2$행정구역별[284:300] <- "함경남도"

df_3$행정구역별[3:20] <- "서울특별시"
df_3$행정구역별[22:39] <- "부산광역시"
df_3$행정구역별[41:58] <- "대구광역시"
df_3$행정구역별[60:77] <- "인천광역시"
df_3$행정구역별[79:96] <- "광주광역시"
df_3$행정구역별[98:115] <- "대전광역시"
df_3$행정구역별[117:134] <- "울산광역시"
df_3$행정구역별[136:153] <- "경기도"
df_3$행정구역별[155:172] <- "강원도"
df_3$행정구역별[174:191] <- "충청북도"
df_3$행정구역별[193:210] <- "충청남도"
df_3$행정구역별[212:229] <- "전라북도"
df_3$행정구역별[231:248] <- "전라남도"
df_3$행정구역별[250:267] <- "경상북도"
df_3$행정구역별[266:286] <- "경상남도"
df_3$행정구역별[287:305] <- "제주도"

df_4$행정구역별[3:22] <- "서울특별시"
df_4$행정구역별[24:43] <- "부산광역시"
df_4$행정구역별[45:64] <- "대구광역시"
df_4$행정구역별[66:85] <- "인천광역시"
df_4$행정구역별[87:106] <- "광주광역시"
df_4$행정구역별[108:127] <- "대전광역시"
df_4$행정구역별[129:148] <- "울산광역시"
df_4$행정구역별[150:169] <- "세종특별자치시"
df_4$행정구역별[171:190] <- "경기도"
df_4$행정구역별[192:211] <- "강원도"
df_4$행정구역별[213:232] <- "충청북도"
df_4$행정구역별[234:253] <- "충청남도"
df_4$행정구역별[255:274] <- "전라북도"
df_4$행정구역별[276:295] <- "전라남도"
df_4$행정구역별[297:316] <- "경상북도"
df_4$행정구역별[318:337] <- "경상남도"
df_4$행정구역별[339:358] <- "제주도"

# View(df_1)
# View(df_2)
# View(df_3)
View(df_4)
